cf/src/Catalogs/СерверыПечати/СерверыПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверыПечати</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

cf/src/Catalogs/СерверыПечати/Forms/ФормаЭлемента/Module.bsl
// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНаименование(ЭтаФорма, "");
	ОбновитьВидимостьЭлементовФормы()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьПроксиПриИзменении(Элемент)
		
	Объект.ПроксиПароль = "";
	Объект.ПроксиПользователь = "";
	Объект.ПроксиПорт = 0;
	Объект.ПроксиСервер = "";
	
	ОбновитьВидимостьЭлементовФормы()
		
КонецПроцедуры

&НаКлиенте
Процедура СерверОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбновитьНаименование(Элемент, Текст);
	//Автоматически не обновляется значение самого поля
	ДанныеВыборка = Новый СписокЗначений();
	ДанныеВыборка.Добавить(Текст);
		
КонецПроцедуры

&НаКлиенте
Процедура ПортОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбновитьНаименование(Элемент, Текст);
	//Автоматически не обновляется значение самого поля
	ДанныеВыборка = Новый СписокЗначений();
	ДанныеВыборка.Добавить(Текст);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовФормы()
	
	Элементы.ГруппаПрокси.Видимость = Объект.ИспользоватьПрокси;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименование(Элемент, Текст)
	
	ТекущееНаименование = Объект.Наименование;
	ТекущееНаименованиеПоШаблону = СтрШаблон("%1:%2",Объект.Сервер,Формат(Объект.Порт,"ЧРГ=; ЧГ=;"));
	Если ТекущееНаименование = ТекущееНаименованиеПоШаблону Или ТекущееНаименование = "" Тогда
		Если Элемент = Элементы.Порт Тогда
			НовоеНаименование = СтрШаблон("%1:%2",Объект.Сервер,Текст);
		ИначеЕсли Элемент = Элементы.Сервер Тогда
			НовоеНаименование = СтрШаблон("%1:%2",Текст,Формат(Объект.Порт,"ЧРГ=; ЧГ=;"));
		Иначе
			НовоеНаименование = ТекущееНаименование;
		КонецЕсли;
		Объект.Наименование = НовоеНаименование;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
